app/controllers/photos_controller.rb

SELECT * FROM `photos` ORDER BY created_at DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `photos`
SELECT * FROM `albums`
---
  def index
    @photos = Photo.paginate :page=>params[:page]||1,:per_page=>20,:order=>"created_at DESC"
    tag_cloud
    @albums = Album.all

SELECT * FROM `photos` WHERE (`photos`.`id` = 0)
---
  def show
    @photo = Photo.find(params[:id])