app/controllers/welcome_controller.rb

SELECT * FROM `projects` WHERE (cn_name like '留学指南') ORDER BY created_at DESC LIMIT 1
---
  def load_projects
    @projects = Project.all

SELECT * FROM `photos` WHERE (`photos`.`id` = 32)
SELECT * FROM `album_photos` WHERE (`album_photos`.`photo_id` = 32) LIMIT 1
SELECT * FROM `album_photos` WHERE (album_id = 1) ORDER BY created_at desc LIMIT 0, 9
SELECT * FROM `albums` ORDER BY albums.id DESC LIMIT 1
SELECT count(*) AS count_all FROM `album_photos` WHERE (album_id = 1)
---
  def picture
    # @album_photos = AlbumPhoto.paginate :page=>params[:page]||1, :per_page=>9, :order=>"created_at desc"
    @picture = Photo.find(params[:id]||Photo.first)
    @arr =[]
    album_photo = AlbumPhoto.find_by_photo_id(@picture.id)
    @album_photos = AlbumPhoto.paginate :page=>params[:page]||1, :per_page=>9,:conditions=>"album_id = #{album_photo.album_id}",:order=>'created_at desc'